#### Задание 1

```
Импортируйте библиотеку Pandas и дайте ей псевдоним pd.
Создайте датафрейм authors со столбцами author_id и author_name,
в которых соответственно содержатся данные:
[1, 2, 3] и ['Тургенев', 'Чехов', 'Островский'].

Затем создайте датафрейм book cо столбцами author_id, book_title и price,
в которых соответственно содержатся данные: 
[1, 1, 1, 2, 2, 3, 3],
['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],
[450, 300, 350, 500, 450, 370, 290].

```

In [ ]:
import pandas as pd

In [ ]:
authors = pd.DataFrame({'author_id': [1, 2, 3],
                        'author_name': ['Тургенев', 'Чехов', 'Островский']}, 
                       columns=['author_id', 'author_name'])

In [ ]:
authors

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский

In [ ]:
books = pd.DataFrame({'author_id': [1, 1, 1, 2, 2, 3, 3], 
                      'book_title': ['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 
                                     'Дама с собачкой', 'Гроза', 'Таланты и поклонники'], 
                      'price': [450, 300, 350, 500, 450, 370, 290]},
                     columns=['author_id', 'book_title', 'price'])

In [ ]:
books

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

#### Задание 2

```
Получите датафрейм authors_price, соединив датафреймы authors и books по полю author_id.
```

In [ ]:
authors_price = pd.merge(authors, books, on='author_id', how='inner')

In [ ]:
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

#### Задание 3

```
Создайте датафрейм top5, в котором собержатся строки из authors_price 
с пятью самыми дорогими книгами.
```

In [ ]:
top5 = authors_price.nlargest(5, 'price')
top5

   author_id author_name         book_title  price
3          2       Чехов   Толстый и тонкий    500
0          1    Тургенев        Отцы и дети    450
4          2       Чехов    Дама с собачкой    450
5          3  Островский              Гроза    370
2          1    Тургенев  Дворянское гнездо    350

<h4>* Задание 4</h4>

```
Создайте датафрейм authors_stat на основе информации из authors_price.
В датафрейме authors_stat должны быть четыре столбца:
author_name, min_price, max_price и mean_price,
в которых должны содержаться соответственно имя автора,
минимальная, максимальная и средняя цена на книги этого автора.
```

In [ ]:
min_authors_price = authors_price.groupby('author_name').agg({'price': 'min'})
min_authors_price

             price
author_name
Островский     290
Тургенев       300
Чехов          450

In [ ]:
min_authors_price = min_authors_price.reset_index()
min_authors_price

  author_name  price
0  Островский    290
1    Тургенев    300
2       Чехов    450

In [ ]:
min_authors_price = min_authors_price.rename(columns={'price':'min_price'})
min_authors_price

  author_name  min_price
0  Островский        290
1    Тургенев        300
2       Чехов        450

In [ ]:
max_authors_price = authors_price.groupby('author_name').agg({'price': 'max'})
max_authors_price = max_authors_price.reset_index()
max_authors_price = max_authors_price.rename(columns={'price':'max_price'})

max_authors_price

  author_name  max_price
0  Островский        370
1    Тургенев        450
2       Чехов        500

In [ ]:
mean_authors_price = authors_price.groupby('author_name').agg({'price': 'mean'})
mean_authors_price = mean_authors_price.reset_index()
mean_authors_price = mean_authors_price.rename(columns={'price':'mean_price'})

mean_authors_price

  author_name  mean_price
0  Островский  330.000000
1    Тургенев  366.666667
2       Чехов  475.000000

In [ ]:
authors_stat_pre = pd.merge(min_authors_price, max_authors_price, on='author_name', how='inner')
authors_stat_pre

  author_name  min_price  max_price
0  Островский        290        370
1    Тургенев        300        450
2       Чехов        450        500

In [ ]:
authors_stat = pd.merge(authors_stat_pre, mean_authors_price, on='author_name', how='inner')
authors_stat

  author_name  min_price  max_price  mean_price
0  Островский        290        370  330.000000
1    Тургенев        300        450  366.666667
2       Чехов        450        500  475.000000

Либо можно получить тот же результат буквально в одну строку:

In [ ]:
authors_price.groupby('author_name')['price'].agg(['min', 'max', 'mean']).\
              reset_index().rename(columns={'min':'min_price', 'max':'max_price', 'mean':'mean_price'})

  author_name  min_price  max_price  mean_price
0  Островский        290        370  330.000000
1    Тургенев        300        450  366.666667
2       Чехов        450        500  475.000000

<h4>* Задание 5</h4>

```
Создайте новый столбец в датафрейме authors_price под названием cover,
в нем будут располагаться данные о том, какая обложка у данной книги - твердая или мягкая.
В этот столбец поместите данные из следующего списка:
['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая'].

Просмотрите документацию по функции pd.pivot_table 
с помощью вопросительного знака.

Для каждого автора посчитайте суммарную стоимость книг в твердой и мягкой обложке.
Используйте для этого функцию pd.pivot_table. 
При этом столбцы должны называться "твердая" и "мягкая",
а индексами должны быть фамилии авторов. Пропущенные значения стоимостей заполните нулями,
при необходимости загрузите библиотеку Numpy.

Назовите полученный датасет book_info и сохраните его в формат pickle под названием "book_info.pkl".
Затем загрузите из этого файла датафрейм и назовите его book_info2.
Удостоверьтесь, что датафреймы book_info и book_info2 идентичны.
```

In [ ]:
authors_price['cover'] = ['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая']

In [ ]:
authors_price

   author_id author_name            book_title  price    cover
0          1    Тургенев           Отцы и дети    450  твердая
1          1    Тургенев                 Рудин    300   мягкая
2          1    Тургенев     Дворянское гнездо    350   мягкая
3          2       Чехов      Толстый и тонкий    500  твердая
4          2       Чехов       Дама с собачкой    450  твердая
5          3  Островский                 Гроза    370   мягкая
6          3  Островский  Таланты и поклонники    290   мягкая

In [ ]:
? pd.pivot_table

In [ ]:
import numpy as np

In [ ]:
book_info = pd.pivot_table(data=authors_price, values='price', index='author_name', columns='cover', aggfunc=np.sum).fillna(0)
book_info

cover        мягкая  твердая
author_name
Островский    660.0      0.0
Тургенев      650.0    450.0
Чехов           0.0    950.0

In [ ]:
book_info.to_pickle('book_info.pkl')

In [ ]:
book_info2 = pd.read_pickle('book_info.pkl')

In [ ]:
book_info2

cover        мягкая  твердая
author_name
Островский    660.0      0.0
Тургенев      650.0    450.0
Чехов           0.0    950.0